# Примечания:
# В заданиях 2, 3, 4, 7, 8, 9 пользователь вводит только натуральные числа.
# Попытайтесь решить задания без использования массивов в любых вариациях
# (массивы будут рассмотрены на следующем уроке).
# Для простоты понимания любые квадратные скобки [ и ] считаются массивами и их наличие
# в коде расценивается как неверное решение.
# Договариваемся об идеальном пользователе, который вводит только верные данные,
# которые требует программа. Проверка ввода не обязательна.
# Уделите это время в первую очередь построению графического алгоритма,
# а затем написанию кода по этому алгоритму. Не наоборот.
