# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

# Решение через dict - 2 варианта (либо словарь кратко, либо один принт)

month = int(input('Введите месяц от 1 до 12: '))
# 1 вариант через Dict-------------------------------------------------
dict_season = {
    'зима': (12, 1, 2),
    'весна': (3, 4, 5),
    'лето': (6, 7, 8),
    'осень': (9, 10, 11)
}

for next_season in dict_season.keys():
    if month in dict_season.get(next_season):
        print(f'Вариант 1 через Dict: {next_season}')

# 2 вариант через Dict-------------------------------------------------
dict_season_2 = {
    12: 'зима',
    1: 'зима',
    2: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень'
}

print(f'Вариант 2 через Dict: {dict_season_2.get(month)}')

# вариант через List-------------------------------------------------
list_season = [
    ['зима', [12, 1, 2]],
    ['весна', [3, 4, 5]],
    ['лето', [6, 7, 8]],
    ['осень', [9, 10, 11]],
]
for next_season in list_season:
    if month in next_season[1]:
        print(f'Вариант через List: {next_season[0]}')
